In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('D:/data/2022_data.csv')
df.drop(columns=['등록일자'],inplace=True)
df.head()

       사용일자  노선명   역명  승차총승객수  하차총승객수
0  20220101  3호선   수서    7370    7076
1  20220101  3호선  학여울     461     473
2  20220101  3호선   대청    3224    2903
3  20220101  3호선   일원    3321    2803
4  20220101  경원선   창동       1       0

### 1월

In [3]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(3, 25, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220100 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_1 = pd.concat(df_list, axis=0)
df_1['사용일자'] = 202201

df_1 = df_1.groupby(cols)[target].agg('sum').reset_index()

In [4]:
df_1.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202201  1호선  동대문  204145  189264
1  202201  1호선  동묘앞  136976  142877
2  202201  1호선  서울역  833080  798951
3  202201  1호선   시청  428112  429602
4  202201  1호선  신설동  268909  260364

In [5]:
df_1.shape

(609, 5)

In [6]:
# 이렇게 12개월치 구한거
# df_res_list = [df_1,df_2,df_3 ....df_12] 리스트 안에 넣음
# df_res = pd.concat(df_res_list, axis=0) 합침
# 이거에 이제 역명 '(' 지우고 하는 작업하고
# 호선별로 나눈다음에
# line_merge 코드 짜둔거 사용해서 합치면 됨

In [7]:
# 수동
df1 = df[(df.사용일자 >= 20220131)&(df.사용일자 < 20220201)].copy()
df1.groupby(cols)[target].agg('sum').reset_index()
df1.shape

(597, 5)

In [8]:
df_1 = pd.concat([df_1, df1], axis=0)
df_1.tail()

           사용일자    노선명     역명  승차총승객수  하차총승객수
18516  20220131  우이신설선   솔밭공원     975     966
18517  20220131  우이신설선  북한산우이    1641    1683
18518  20220131    안산선    수리산    1333    1225
18519  20220131    안산선    오이도    3753    3975
18520  20220131    안산선     정왕    3878    3739

### 2월

In [9]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(7, 22, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220200 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_2 = pd.concat(df_list, axis=0)
df_2['사용일자'] = 202202

df_2 = df_2.groupby(cols)[target].agg('sum').reset_index()

In [10]:
df_2.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202202  1호선  동대문  145672  135516
1  202202  1호선  동묘앞   97796  102589
2  202202  1호선  서울역  579906  552706
3  202202  1호선   시청  305044  309533
4  202202  1호선  신설동  193710  189479

In [11]:
df_2.shape

(608, 5)

In [12]:
# 수동
df2 = df[(df.사용일자 >= 20220201)&(df.사용일자 < 20220205)].copy()
df2_1 = df[(df.사용일자 >= 20220228)&(df.사용일자 < 20220301)].copy()
df2.groupby(cols)[target].agg('sum').reset_index()
df2.shape

(2383, 5)

In [13]:
df_2.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202202  1호선  동대문  145672  135516
1  202202  1호선  동묘앞   97796  102589
2  202202  1호선  서울역  579906  552706
3  202202  1호선   시청  305044  309533
4  202202  1호선  신설동  193710  189479

In [14]:
df_2 = pd.concat([df_2, df2], axis=0)
df_2.tail()

           사용일자  노선명     역명  승차총승객수  하차총승객수
20899  20220204  3호선  고속터미널   39289   37132
20900  20220204  3호선     잠원    4274    4223
20901  20220204  3호선     신사   31276   32381
20902  20220204  3호선    압구정   32599   34646
20903  20220204  3호선     옥수    8213    8577

### 3월

In [15]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(7, 22, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220300 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_3 = pd.concat(df_list, axis=0)
df_3['사용일자'] = 202203

df_3 = df_3.groupby(cols)[target].agg('sum').reset_index()

In [16]:
df_3.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202203  1호선  동대문  145182  134754
1  202203  1호선  동묘앞  105780  111525
2  202203  1호선  서울역  526397  507826
3  202203  1호선   시청  285581  287793
4  202203  1호선  신설동  185537  180739

In [17]:
df_3.shape

(607, 5)

In [18]:
# 수동
df3 = df[(df.사용일자 >= 20220301)&(df.사용일자 < 20220305)].copy()
df3_1 = df[(df.사용일자 >= 20220328)&(df.사용일자 < 20220401)].copy()
df3.groupby(cols)[target].agg('sum').reset_index()
df3.shape

(2386, 5)

In [19]:
df_3.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202203  1호선  동대문  145182  134754
1  202203  1호선  동묘앞  105780  111525
2  202203  1호선  서울역  526397  507826
3  202203  1호선   시청  285581  287793
4  202203  1호선  신설동  185537  180739

In [20]:
df_3 = pd.concat([df_3, df3_1, df3], axis=0)
df_3.tail()

           사용일자  노선명    역명  승차총승객수  하차총승객수
37614  20220304  장항선    신창    3241    1944
37615  20220304  장항선  온양온천    4098    4377
37616  20220304  장항선    배방    1227    1170
37617  20220304  장항선    탕정     787     622
37618  20220304  5호선    청구    3796    3397

### 4월

In [21]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(4, 26, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220400 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_4 = pd.concat(df_list, axis=0)
df_4['사용일자'] = 202204

df_4 = df_4.groupby(cols)[target].agg('sum').reset_index()

In [22]:
df_4.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202204  1호선  동대문  217638  202980
1  202204  1호선  동묘앞  158507  166370
2  202204  1호선  서울역  860101  835683
3  202204  1호선   시청  451143  459317
4  202204  1호선  신설동  277544  271555

In [23]:
df_4.shape

(606, 5)

In [24]:
# 수동
df4 = df[(df.사용일자 >= 20220401)&(df.사용일자 < 20220402)].copy()
df4.groupby(cols)[target].agg('sum').reset_index()
df4.shape

(594, 5)

In [25]:
df_4.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202204  1호선  동대문  217638  202980
1  202204  1호선  동묘앞  158507  166370
2  202204  1호선  서울역  860101  835683
3  202204  1호선   시청  451143  459317
4  202204  1호선  신설동  277544  271555

In [26]:
df_4 = pd.concat([df_4, df4], axis=0)
df_4.tail()

           사용일자  노선명    역명  승차총승객수  하차총승객수
54289  20220401  수인선   호구포    4047    4148
54290  20220401  수인선  인천논현    5573    6036
54291  20220401  수인선  소래포구    5591    5341
54292  20220401  수인선    월곶    2739    2510
54293  20220401  수인선    달월     122      77

### 5월

In [27]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(2, 24, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220500 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_5 = pd.concat(df_list, axis=0)
df_5['사용일자'] = 202205

df_5 = df_5.groupby(cols)[target].agg('sum').reset_index()

In [28]:
df_5.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202205  1호선  동대문  235227  221251
1  202205  1호선  동묘앞  171615  179713
2  202205  1호선  서울역  968850  948334
3  202205  1호선   시청  489540  496014
4  202205  1호선  신설동  287850  280482

In [29]:
df_5.shape

(602, 5)

In [30]:
# 수동
df5 = df[(df.사용일자 >= 20220530)&(df.사용일자 < 20220601)].copy()
df5.groupby(cols)[target].agg('sum').reset_index()
df5.shape

(1209, 5)

In [31]:
df_5.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202205  1호선  동대문  235227  221251
1  202205  1호선  동묘앞  171615  179713
2  202205  1호선  서울역  968850  948334
3  202205  1호선   시청  489540  496014
4  202205  1호선  신설동  287850  280482

In [32]:
df_5 = pd.concat([df_5, df5], axis=0)
df_5.tail()

           사용일자  노선명  역명  승차총승객수  하차총승객수
90038  20220531  일산선  백석   10884   10871
90039  20220531  일산선  대곡    2478    1927
90040  20220531  일산선  화정   18719   19060
90041  20220531  일산선  원당   12749   11581
90042  20220531  일산선  삼송   22952   21576

### 6월

In [33]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(6, 28, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220600 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_6 = pd.concat(df_list, axis=0)
df_6['사용일자'] = 202206

df_6 = df_6.groupby(cols)[target].agg('sum').reset_index()

In [34]:
df_6.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202206  1호선  동대문  211559  198247
1  202206  1호선  동묘앞  147527  153943
2  202206  1호선  서울역  931382  899189
3  202206  1호선   시청  463077  466015
4  202206  1호선  신설동  266454  254310

In [35]:
df_6.shape

(614, 5)

In [36]:
# 수동
df6 = df[(df.사용일자 >= 20220601)&(df.사용일자 < 20220604)].copy()
df6_1 = df[(df.사용일자 >= 20220627)&(df.사용일자 < 20220730)].copy()
df6.groupby(cols)[target].agg('sum').reset_index()
df6.shape

(1819, 5)

In [37]:
df_6.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202206  1호선  동대문  211559  198247
1  202206  1호선  동묘앞  147527  153943
2  202206  1호선  서울역  931382  899189
3  202206  1호선   시청  463077  466015
4  202206  1호선  신설동  266454  254310

In [38]:
df_6 = pd.concat([df_6, df6], axis=0)
df_6.tail()

           사용일자  노선명     역명  승차총승객수  하차총승객수
91857  20220603  2호선     이대   15454   15881
91858  20220603  2호선     신촌   37542   38122
91859  20220603  경의선     계양       1       0
91860  20220603  2호선   홍대입구   60049   68627
91861  20220603  2호선  영등포구청   23333   24177

### 7월

In [39]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(4, 26, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220700 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_7 = pd.concat(df_list, axis=0)
df_7['사용일자'] = 202207

df_7 = df_7.groupby(cols)[target].agg('sum').reset_index()

In [40]:
df_7.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202207  1호선  동대문  221633  207246
1  202207  1호선  동묘앞  153747  160127
2  202207  1호선  서울역  970884  948840
3  202207  1호선   시청  490930  501232
4  202207  1호선  신설동  282640  275240

In [41]:
df_7.shape

(614, 5)

In [42]:
# 수동
df7 = df[(df.사용일자 >= 20220701)&(df.사용일자 < 20220702)].copy()
df7.groupby(cols)[target].agg('sum').reset_index()
df7.shape

(608, 5)

In [43]:
df_7.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202207  1호선  동대문  221633  207246
1  202207  1호선  동묘앞  153747  160127
2  202207  1호선  서울역  970884  948840
3  202207  1호선   시청  490930  501232
4  202207  1호선  신설동  282640  275240

In [44]:
df_7 = pd.concat([df_7, df7], axis=0)
df_7.tail()

            사용일자  노선명   역명  승차총승객수  하차총승객수
108825  20220701  과천선   평촌   18690   18213
108826  20220701  과천선   범계   27864   29521
108827  20220701  2호선  왕십리   18890   16119
108828  20220701  2호선  한양대    9305    9677
108829  20220701  2호선   뚝섬   24885   26469

### 8월

In [45]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(1, 23, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220800 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_8 = pd.concat(df_list, axis=0)
df_8['사용일자'] = 202208

df_8 = df_8.groupby(cols)[target].agg('sum').reset_index()

In [46]:
df_8.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202208  1호선  동대문  203037  188308
1  202208  1호선  동묘앞  140178  145762
2  202208  1호선  서울역  942101  908015
3  202208  1호선   시청  466054  475743
4  202208  1호선  신설동  255251  249183

In [47]:
df_8.shape

(613, 5)

In [48]:
# 수동
df8 = df[(df.사용일자 >= 20220829)&(df.사용일자 < 20220901)].copy()
df8.groupby(cols)[target].agg('sum').reset_index()
df8.shape

(1821, 5)

In [49]:
df_8.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202208  1호선  동대문  203037  188308
1  202208  1호선  동묘앞  140178  145762
2  202208  1호선  서울역  942101  908015
3  202208  1호선   시청  466054  475743
4  202208  1호선  신설동  255251  249183

In [50]:
df_8 = pd.concat([df_8, df8], axis=0)
df_8.tail()

            사용일자  노선명  역명  승차총승객수  하차총승객수
145789  20220831  중앙선  국수     901     848
145790  20220831  중앙선  아신     639     632
145791  20220831  중앙선  오빈     321     317
145792  20220831  중앙선  양평    2850    2848
145793  20220831  중앙선  용문    1754    1726

### 9월

In [51]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(5, 27, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20220900 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_9 = pd.concat(df_list, axis=0)
df_9['사용일자'] = 202209

df_9 = df_9.groupby(cols)[target].agg('sum').reset_index()

In [52]:
df_9.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202209  1호선  동대문  222757  208422
1  202209  1호선  동묘앞  170179  176652
2  202209  1호선  서울역  973348  962286
3  202209  1호선   시청  494364  503124
4  202209  1호선  신설동  277100  266787

In [53]:
df_9.shape

(613, 5)

In [54]:
# 수동
df9 = df[(df.사용일자 >= 20220901)&(df.사용일자 < 20220903)].copy()
df9.groupby(cols)[target].agg('sum').reset_index()
df9.shape

(1213, 5)

In [55]:
df_9.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202209  1호선  동대문  222757  208422
1  202209  1호선  동묘앞  170179  176652
2  202209  1호선  서울역  973348  962286
3  202209  1호선   시청  494364  503124
4  202209  1호선  신설동  277100  266787

In [56]:
df_9 = pd.concat([df_9, df9], axis=0)
df_9.tail()

            사용일자  노선명    역명  승차총승객수  하차총승객수
147002  20220902  1호선   동대문   11733   10125
147003  20220902  1호선  종로5가   26190   26500
147004  20220902  1호선  종로3가   28474   26575
147005  20220902  1호선    종각   39966   40247
147006  20220902  1호선   서울역   54463   52615

### 10월

In [57]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(3, 25, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20221000 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_10 = pd.concat(df_list, axis=0)
df_10['사용일자'] = 202210

df_10 = df_10.groupby(cols)[target].agg('sum').reset_index()

In [58]:
df_10.head()

     사용일자  노선명   역명   승차총승객수   하차총승객수
0  202210  1호선  동대문   232773   218646
1  202210  1호선  동묘앞   175723   183428
2  202210  1호선  서울역  1043940  1019578
3  202210  1호선   시청   545611   545701
4  202210  1호선  신설동   287589   278479

In [59]:
df_10.shape

(613, 5)

In [60]:
# 수동
df10 = df[(df.사용일자 >= 20221031)&(df.사용일자 < 20221101)].copy()
df10.groupby(cols)[target].agg('sum').reset_index()
df10.shape

(606, 5)

In [61]:
df_10.head()

     사용일자  노선명   역명   승차총승객수   하차총승객수
0  202210  1호선  동대문   232773   218646
1  202210  1호선  동묘앞   175723   183428
2  202210  1호선  서울역  1043940  1019578
3  202210  1호선   시청   545611   545701
4  202210  1호선  신설동   287589   278479

In [62]:
df_10 = pd.concat([df_10, df10], axis=0)
df_10.tail()

            사용일자  노선명    역명  승차총승객수  하차총승객수
182756  20221031  6호선  버티고개    2366    2239
182757  20221031  6호선    약수    3778    3751
182758  20221031  6호선    청구    3842    4067
182759  20221031  6호선    신당    8136    8814
182760  20221031  6호선   동묘앞    8434    8751

### 11월

In [63]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(7, 22, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20221100 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_11 = pd.concat(df_list, axis=0)
df_11['사용일자'] = 202211

df_11 = df_11.groupby(cols)[target].agg('sum').reset_index()

In [64]:
df_11.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202211  1호선  동대문  172082  161544
1  202211  1호선  동묘앞  129313  134742
2  202211  1호선  서울역  805673  778259
3  202211  1호선   시청  410771  416025
4  202211  1호선  신설동  221653  213159

In [65]:
df_11.shape

(614, 5)

In [66]:
# 수동
df11 = df[(df.사용일자 >= 20221101)&(df.사용일자 < 20221105)].copy()
df11_1 = df[(df.사용일자 >= 20221128)&(df.사용일자 < 20221201)].copy()
df11.groupby(cols)[target].agg('sum').reset_index()
df11.shape

(2426, 5)

In [67]:
df_11.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202211  1호선  동대문  172082  161544
1  202211  1호선  동묘앞  129313  134742
2  202211  1호선  서울역  805673  778259
3  202211  1호선   시청  410771  416025
4  202211  1호선  신설동  221653  213159

In [68]:
df_11 = pd.concat([df_11, df11, df11_1], axis=0)
df_11.tail()

            사용일자  노선명    역명  승차총승객수  하차총승객수
200938  20221130  5호선    마곡   11444   11372
200939  20221130  5호선    송정    6629    6244
200940  20221130  5호선  김포공항    7544    7079
200941  20221130  5호선   개화산    5928    5684
200942  20221130  5호선    방화    6947    6706

### 12월

In [69]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(5, 27, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20221200 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_12 = pd.concat(df_list, axis=0)
df_12['사용일자'] = 202212

df_12 = df_12.groupby(cols)[target].agg('sum').reset_index()

In [70]:
df_12.head()

     사용일자  노선명   역명   승차총승객수   하차총승객수
0  202212  1호선  동대문   231331   215960
1  202212  1호선  동묘앞   157263   163877
2  202212  1호선  서울역  1080371  1044023
3  202212  1호선   시청   562084   560096
4  202212  1호선  신설동   290852   281032

In [71]:
df_12.shape

(612, 5)

In [72]:
# 수동
df12 = df[(df.사용일자 >= 20221201)&(df.사용일자 < 20221203)].copy()
df12.groupby(cols)[target].agg('sum').reset_index()
df12.shape

(1211, 5)

In [73]:
df_12.head()

     사용일자  노선명   역명   승차총승객수   하차총승객수
0  202212  1호선  동대문   231331   215960
1  202212  1호선  동묘앞   157263   163877
2  202212  1호선  서울역  1080371  1044023
3  202212  1호선   시청   562084   560096
4  202212  1호선  신설동   290852   281032

In [74]:
df_12 = pd.concat([df_12, df12], axis=0)
df_12.tail()

            사용일자  노선명    역명  승차총승객수  하차총승객수
202149  20221202  1호선  종로5가   25170   25079
202150  20221202  1호선  종로3가   27534   25613
202151  20221202  1호선    종각   41940   41629
202152  20221202  1호선    시청   27666   28152
202153  20221202  1호선   서울역   56380   55408

In [75]:
# df_res_list = [df_1,df_2,df_3 ....df_12] 리스트 안에 넣음
df_res_list = [df_1,df_2,df_3,df_4,df_5,df_6,df_7,df_8,df_9,df_10,df_11,df_12]

In [76]:
# df_res = pd.concat(df_res_list, axis=0) 합침
df_res = pd.concat(df_res_list, axis=0)

In [77]:
df_res

            사용일자  노선명    역명  승차총승객수  하차총승객수
0         202201  1호선   동대문  204145  189264
1         202201  1호선   동묘앞  136976  142877
2         202201  1호선   서울역  833080  798951
3         202201  1호선    시청  428112  429602
4         202201  1호선   신설동  268909  260364
...          ...  ...   ...     ...     ...
202149  20221202  1호선  종로5가   25170   25079
202150  20221202  1호선  종로3가   27534   25613
202151  20221202  1호선    종각   41940   41629
202152  20221202  1호선    시청   27666   28152
202153  20221202  1호선   서울역   56380   55408

[28394 rows x 5 columns]

In [78]:
# 이거에 이제 역명 '(' 지우고 하는 작업하고
# 호선별로 나눈다음에
# line_merge 코드 짜둔거 사용해서 합치면 됨

In [79]:
df1 = df.copy()
cols = list(df.columns)[:3]
target = list(df.columns)[3:]

In [80]:
# '사용일' 열을 datetime 형식으로 변환
df1['사용일자'] = pd.to_datetime(df1['사용일자'], format='%Y%m%d')
# 평일과 주말 구분하는 새로운 열 생성
df1['주중/주말'] = df1['사용일자'].apply(lambda x: '주말' if x.weekday() >= 5 else '주중')
# 평일 데이터만 선택
weekday_df = df1[df1['주중/주말'] == '주중']

In [81]:
week_df = weekday_df.copy()
week_df['사용일자'] = pd.to_datetime(weekday_df['사용일자']).dt.strftime('%Y%m%d').astype(int)

In [82]:
week_df

            사용일자       노선명     역명  승차총승객수  하차총승객수 주중/주말
1195    20220103       수인선     사리    4127    3724    주중
1196    20220103       수인선     달월      93      50    주중
1197    20220103       수인선     월곶    2303    2138    주중
1198    20220103       수인선   소래포구    4292    3950    주중
1199    20220103       수인선   인천논현    5040    5391    주중
...          ...       ...    ...     ...     ...   ...
219133  20221230  9호선2~3단계     언주   10031   10034    주중
219134  20221230  9호선2~3단계    선정릉    8603    9286    주중
219135  20221230  9호선2~3단계   삼성중앙    7006    7258    주중
219136  20221230  9호선2~3단계    봉은사   18999   19414    주중
219137  20221230  9호선2~3단계  종합운동장    4706    4863    주중

[156578 rows x 6 columns]

In [83]:
df_list = []
for i in range(1, 13):
    start_date = 20210000 + i*100
    end_date = start_date + 100
    df_temp = week_df[(week_df['사용일자'] >= start_date) & (week_df['사용일자'] < end_date)].copy()
    df_temp['사용일자'] = 202100 + i
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_res = pd.concat(df_list, axis=0)

In [84]:
# 이후로는 line merge 해야함.

In [ ]:
# 1~12월 다 합치고 불러와서 아래 실행
# 호선명 리스트로 추출해서 사용 
lines = df.호선명.unique().tolist()
df_dict = {line: df[df['호선명'] == line].copy() for line in lines}
for line, frame in df_dict.items():
    # frame = df[df['호선명']==line].copy()
    frame['총 승차인원'] = frame.loc[:,['승차총승객수']].sum(axis=1)
    frame['총 하차인원'] = frame.loc[:,['하차총승객수']].sum(axis=1)

    frame.to_csv(f'data/main/{line}.csv',index=False,encoding='utf-8')

In [ ]:
# 저장 위치 고치기
line_info = [
    (['./1호선.csv', './경부선.csv', './경원선.csv', './경인선.csv', './장항선.csv'], '1호선'),
    (['./2호선.csv'], '2호선'),
    (['./3호선.csv', './일산선.csv'], '3호선'),
    (['./4호선.csv', './과천선.csv', './안산선.csv'], '4호선'),
    (['./5호선.csv'], '5호선'),
    (['./6호선.csv'], '6호선'),
    (['./7호선.csv'], '7호선'),
    (['./8호선.csv'], '8호선'),
    (['./9호선.csv', './9호선2단계.csv', './9호선2~3단계.csv'], '9호선'),
    (['./수인선.csv', './분당선.csv'], '수인분당선'),
    (['./경의선.csv', './용산선.csv''./경원선.csv', './중앙선.csv'], '경의중앙선')

]

for df_list, line_name in line_info:
    df_copies = []
    for file in df_list:
        df = pd.read_csv(file)
        df_copies.append(df.copy())
    result = pd.concat(df_copies, axis=0)
    result = result.reset_index(drop=True)
    result.호선명 = line_name
    cols = list(result.columns)[:3]
    target = list(result.columns)[3:]
    res = result.groupby(cols)[target].agg('sum').reset_index()
    res.to_csv(f'./lines/{line_name}.csv', index=False)